# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [7]:
first = pd.Series(np.random.randint(1,5,100))
second = pd.Series(np.random.randint(1,4,100))
third = pd.Series(np.random.randint(10000,30001,100))

In [10]:
third

0     28963
1     13195
2     26152
3     24336
4     13514
      ...
95    11058
96    25720
97    25528
98    19650
99    20384
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [14]:
df = pd.DataFrame({'series1': first, 'series2': second, 'series3':third})

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [16]:
df.columns = ['bedrs','bathrs','price_sqr_meter']

In [17]:
df

    bedrs  bathrs  price_sqr_meter
0       2       2            28963
1       4       3            13195
2       2       3            26152
3       2       3            24336
4       4       2            13514
..    ...     ...              ...
95      4       3            11058
96      2       2            25720
97      4       1            25528
98      1       2            19650
99      3       2            20384

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [23]:
bigcolumn = pd.DataFrame(pd.concat([first, second, third]))

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [24]:
bigcolumn

        0
0       2
1       4
2       2
3       2
4       4
..    ...
95  11058
96  25720
97  25528
98  19650
99  20384

[300 rows x 1 columns]

In [28]:
# The problem is that the index repeats since it wasn't reset. That is there are 3 of every index number. See below:
bigcolumn.iloc[101]

0    3
Name: 1, dtype: int32

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [30]:
bigcolumn.reset_index(drop = True)

         0
0        2
1        4
2        2
3        2
4        4
..     ...
295  11058
296  25720
297  25528
298  19650
299  20384

[300 rows x 1 columns]